---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeWall
source: html/e5d567c5-b36b-e93b-0fe9-8425f482bb87.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeWall Property

Can't make Wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakeWall { get; }
```